Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.IsSignedIn
Checks whether there is a authenticated user.

Autodesk.Navisworks.Api.ApplicationParts.IApplicationGui.SignInUserName
Gets the current authenticated user's Autodesk ID.
Returns: Autodesk ID. Null if no user is authenticated.